Repository: grodansparadis/vscp-install-deb
Catalog: docs/samba/debian/po/*.po
Languages: tr

source: Upgrade from Samba 3?
tr: Samba 3'ten güncelleştir?

source: It is possible to migrate the existing configuration files from Samba 3 to Samba 4. This is likely to fail for complex setups, but should provide a good starting point for most existing installations.
tr: Varolan yapılandırma dosyalarının Samba 3'ten Samba 4'e transferi mümkündür. Karmaşık yapılandırmalar için bunun başarısız olması mümkündür, fakat kurulumların çoğunluğu için iyi bir başlangıç noktası sağlayacaktır.

source: Server role
tr: Sunucu rolü

source: Domain controllers manage NT4-style or Active Directory domains and provide services such as identity management and domain logons. Each domain needs to have a at least one domain controller.
tr: Alan kontrolcüleri NT4-style yada Aktif Dizin alanlarını yönetim vealan girişleri ve kimlik yönetimi gibi servisler sunar.Her alanın en az birtane alan kontrolcüsü olmalı.

source: Member servers can be part of a NT4-style or Active Directory domain but do not provide any domain services. Workstations and file or print servers are usually regular domain members.
tr: Üye sunucular NT4-style yada Aktif Dizin alanının bir parçası olabilirfakat herhangi bir alan servisi sunamazlar.İş istasyonları yada yazıcı sunucularıgenellikle normal alan üyerleridirler.

source: A standalone server can not be used in a domain and only supports file sharing and Windows for Workgroups-style logins.
tr: Tek başına bir sunucu alan içinde kullanılamaz ve sadece dosya paylaşımı ve çalıma grupları stili Windows kulanıcı girişlerini destekler.

source: Realm name:
tr: Realm adı:

source: Please specify the Kerberos realm for the domain that this domain controller controls.
tr: Lütfen bu alan kontrolcüsünün kontrol ettiği alan için Kerberos realmını belirtiniz

source: Usually this is the a capitalized version of your DNS hostname.
tr: Genellikle bu büyük harfle yazılmış sizin DNS konak adıdır.

source: Samba server and utilities
tr: Samba sunucusu ve yardımcı uygulamaları

source: Modify smb.conf to use WINS settings from DHCP?
tr: WINS ayarlarını DHCP'den kullanmak için smb.conf dosyasında değişiklik yapılsın mı?

source: If your computer gets IP address information from a DHCP server on the network, the DHCP server may also provide information about WINS servers ("NetBIOS name servers") present on the network. This requires a change to your smb.conf file so that DHCP-provided WINS settings will automatically be read from /etc/samba/dhcp.conf.
tr: Eğer bilgisayarınız IP adresini ağınızdaki bir DHCP sunucusundan alıyorsa, DHCP sunucusu ayrıca ağınızda bulunan WINS sunucuları ("NetBIOS alanadı sunucuları") hakkında da bilgi verebilir. Bu, smb.conf dosyanızda DHCP tarafından sunulan WINS ayarlarının otomatik olarak /etc/samba/dhcp.conf dosyasından okunmasını sağlayan bir değişikliği gerektirir.

source: The dhcp-client package must be installed to take advantage of this feature.
tr: Bu özellikten yararlanabilmek için dhcp-client paketinin kurulmuş olması gerekir.

source: Configure smb.conf automatically?
tr: smb.conf dosyası otomatik olarak yapılandırılsın mı?

source: The rest of the configuration of Samba deals with questions that affect parameters in /etc/samba/smb.conf, which is the file used to configure the Samba programs (nmbd and smbd). Your current smb.conf contains an "include" line or an option that spans multiple lines, which could confuse the automated configuration process and require you to edit your smb.conf by hand to get it working again.
tr: Geri kalan Samba yapılandırması, Samba uygulamalarını (nmbd ve smbd) yapılandırmak için kullanılan /etc/samba/smb.conf dosyasındaki parametreleri etkileyen sorularla sürecektir. Varolan smb.conf dosyası, kendiliğinden yapılandırma sürecini şaşırtabilecek bir "include" satırı ya da birden fazla satıra yayılan bir seçenek içerdiğinden Samba'nın yeniden çalışabilmesi için bu dosyanın elle düzenlenmesi gerekebilir.

source: If you do not choose this option, you will have to handle any configuration changes yourself, and will not be able to take advantage of periodic configuration enhancements.
tr: Eğer bu seçeneği seçmezseniz, bütün yapılandırma değişikliklerini kendiniz yapmak zorunda kalacak ve periyodik yapılandırma iyileştirmelerinin avantajlarını kullanamayacaksınız.

source: Workgroup/Domain Name:
tr: Çalışma Grubu / Etki Alanı Adı:

source: Please specify the workgroup for this system. This setting controls which workgroup the system will appear in when used as a server, the default workgroup to be used when browsing with various frontends, and the domain name used with the "security=domain" setting.
tr: Lütfen bu sistem için bir çalışma grubu (workgroup) belirtin. Bu ayar sistemin sunucu olarak kullanıldığı durumda hangi çalışma grubunda gözükeceğini belirleyeceği gibi, ağda yapılacak göz atmalarda öntanımlı çalışma grubu olacak ve ayrıca "security=domain" ayarında alan adı olarak kullanılacaktır.
